app/Controllers/AuthController.php

    public function guardarRegistro()
    {
        $usuarioModel = new UsuarioModel();

        $passwordHash = password_hash(
            $this->request->getPost('password'),
            PASSWORD_BCRYPT
        );

        $usuarioModel->insert([
            'nombre' => $this->request->getPost('nombre'),
            'email' => $this->request->getPost('email'),
            'password' => $passwordHash
        ]);
---
INSERT INTO `usuarios` (`nombre`, `email`, `password`, `created_at`, `updated_at`) VALUES ('Isaac Leon', 'ejemplo@gmail.com', '$2y$10$wy0r9yT5NgNP2cDd21HyG.ESjZ4m3hq4uj3mBFVnIoI4HFXuPR07.', '2026-02-27 21:32:39', '2026-02-27 21:32:39')

    public function validarLogin()
    {
        $usuarioModel = new UsuarioModel();

        $usuario = $usuarioModel
            ->where('email', $this->request->getPost('email'))
            ->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'luxprower19@gmail.com'
 LIMIT 1