app/Controllers/ChatController.php

SELECT *
FROM `conversaciones`
WHERE   (
`usuario1_id` = '4'
AND `usuario2_id` = '3'
 )
OR   (
`usuario1_id` = '3'
AND `usuario2_id` = '4'
 )
INSERT INTO `conversaciones` (`usuario1_id`, `usuario2_id`, `created_at`) VALUES ('4', '3', '2026-03-05 15:20:52')
---
    public function chat($usuarioDestinoId)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();
        $encrypter = \Config\Services::encrypter();

        $miId = session()->get('usuario_id');


        $builder = $db->table('conversaciones');
        $conversacion = $builder
            ->groupStart()
                ->where('usuario1_id', $miId)
                ->where('usuario2_id', $usuarioDestinoId)
            ->groupEnd()
            ->orGroupStart()
                ->where('usuario1_id', $usuarioDestinoId)
                ->where('usuario2_id', $miId)
            ->groupEnd()
            ->get()
            ->getRowArray();


        if (!$conversacion) {
            $builder->insert([
                'usuario1_id' => $miId,
                'usuario2_id' => $usuarioDestinoId,
                'created_at' => date('Y-m-d H:i:s')
            ]);

SELECT *
FROM `mensajes`
WHERE `conversacion_id` = 5
ORDER BY `id` ASC
---
        }

        // Obtener mensajes
        $mensajes = $db->table('mensajes')
            ->where('conversacion_id', $conversacionId)
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();

INSERT INTO `mensajes` (`conversacion_id`, `remitente_id`, `mensaje_cifrado`, `archivo`, `tipo`, `created_at`) VALUES ('2', '1', 'p3oxwAWy7fXRa69mZZEZqx37cidIlQuhsqNYZyBVLhL9NNn9z28JihkZXce3Jt186QB6/DvJdta/Npvqtn/kLAv1Cg5cpDQnCWssSJ5rxxHMK0cEAJRc2g/+hHdW2w==', '1772776572_a797d904df163a7fae00.png', 'imagen', '2026-03-06 05:56:12')
---
        $mensajeCifrado = base64_encode($encrypter->encrypt($mensaje));
    }

    $db->table('mensajes')->insert([

        'conversacion_id' => $this->request->getPost('conversacion_id'),
        'remitente_id' => session()->get('usuario_id'),
        'mensaje_cifrado' => $mensajeCifrado,
        'archivo' => $nombreArchivo,
        'tipo' => $tipo,
        'created_at' => date('Y-m-d H:i:s')

    ]);

SELECT *
FROM `mensajes`
WHERE `conversacion_id` = '4'
ORDER BY `id` ASC
---
public function obtenerMensajes($conversacionId)
{
    $db = \Config\Database::connect();
    $encrypter = \Config\Services::encrypter();

    $mensajes = $db->table('mensajes')
        ->where('conversacion_id', $conversacionId)
        ->orderBy('id', 'ASC')
        ->get()
        ->getResultArray();