app/Controllers/UsuariosController.php

SELECT *
FROM `usuarios`
WHERE `id` != '1'
---
    public function index()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/login');
        }

        $usuarioModel = new UsuarioModel();

        $usuarios = $usuarioModel
            ->where('id !=', session()->get('usuario_id'))
            ->findAll();